# Dataframe concatenations

In [1]:
import pandas as pd

In [2]:
series1 = pd.Series([1, 2, 3, 4, 5])
series2 = pd.Series(['A', 'B', 'C', 'D', 'E'])

In [3]:
series1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
series2

0    A
1    B
2    C
3    D
4    E
dtype: object

## Concatenate vertically

In [5]:
pd.concat([series1, series2])

0    1
1    2
2    3
3    4
4    5
0    A
1    B
2    C
3    D
4    E
dtype: object

In [7]:
pd.concat([series1, series2], axis=0)

0    1
1    2
2    3
3    4
4    5
0    A
1    B
2    C
3    D
4    E
dtype: object

## Concatenate horizontally

In [11]:
pd.concat([series2, series1], axis=1)

   0  1
0  A  1
1  B  2
2  C  3
3  D  4
4  E  5

## Concatenate series with different composition

In [13]:
series3 = pd.Series([1, 2, 3, 4, 5])
series4 = pd.Series(['A', 'B', 'C', 'D'])

In [14]:
series3

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
series4

0    A
1    B
2    C
3    D
dtype: object

In [17]:
pd.concat([series3, series4])

0    1
1    2
2    3
3    4
4    5
0    A
1    B
2    C
3    D
dtype: object

Concatenate different values horizontally

In [18]:
pd.concat([series3, series4], axis=1)

   0    1
0  1    A
1  2    B
2  3    C
3  4    D
4  5  NaN

## Concatenate series vartically using `concat()` and reset the index

In [19]:
series5 = pd.Series([1, 2, 3, 4, 5])
series6 = pd.Series(['A', 'B', 'C', 'D', 'E'])

In [20]:
series5

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [21]:
series6

0    A
1    B
2    C
3    D
4    E
dtype: object

In [23]:
pd.concat([series5, series6], axis=0, ignore_index=True)

0    1
1    2
2    3
3    4
4    5
5    A
6    B
7    C
8    D
9    E
dtype: object

## Concatenate dataframes horizontally using `concat()`

In [24]:
data1 = {
    'Name' : ['Paul', 'Aaron', 'Krista', 'Veronica', 'Paxton', 'Madison', 'Aurora'],
    'Score': [98, 89, 99, 87, 90, 83, 82]
}

data2 = {
    'Name' : ['Paul', 'Aaron', 'Krista', 'Veronica', 'Aurora', 'Madison', 'Paxton'],
    'Score': [98, 89, 99, 87, 82, 83, 90]
}

df1 = pd.DataFrame(data1, index=[0, 1, 2, 3, 4, 5, 6])
df2 = pd.DataFrame(data2, index=[0, 1, 2, 14, 15, 16, 17])

In [25]:
df1

       Name  Score
0      Paul     98
1     Aaron     89
2    Krista     99
3  Veronica     87
4    Paxton     90
5   Madison     83
6    Aurora     82

In [26]:
df2

        Name  Score
0       Paul     98
1      Aaron     89
2     Krista     99
14  Veronica     87
15    Aurora     82
16   Madison     83
17    Paxton     90

In [27]:
pd.concat([df1, df2], axis=1)

        Name  Score      Name  Score
0       Paul   98.0      Paul   98.0
1      Aaron   89.0     Aaron   89.0
2     Krista   99.0    Krista   99.0
3   Veronica   87.0       NaN    NaN
4     Paxton   90.0       NaN    NaN
5    Madison   83.0       NaN    NaN
6     Aurora   82.0       NaN    NaN
14       NaN    NaN  Veronica   87.0
15       NaN    NaN    Aurora   82.0
16       NaN    NaN   Madison   83.0
17       NaN    NaN    Paxton   90.0

In [28]:
pd.concat([df1, df2], axis=0)

        Name  Score
0       Paul     98
1      Aaron     89
2     Krista     99
3   Veronica     87
4     Paxton     90
5    Madison     83
6     Aurora     82
0       Paul     98
1      Aaron     89
2     Krista     99
14  Veronica     87
15    Aurora     82
16   Madison     83
17    Paxton     90

In [29]:
pd.concat([df1, df2], axis=0, ignore_index=True)

        Name  Score
0       Paul     98
1      Aaron     89
2     Krista     99
3   Veronica     87
4     Paxton     90
5    Madison     83
6     Aurora     82
7       Paul     98
8      Aaron     89
9     Krista     99
10  Veronica     87
11    Aurora     82
12   Madison     83
13    Paxton     90

## Join

In [30]:
pd.concat([df1, df2], axis=1, join='inner')

     Name  Score    Name  Score
0    Paul     98    Paul     98
1   Aaron     89   Aaron     89
2  Krista     99  Krista     99